The  CodeCheckingParameterServiceData  type exposes the following members.
 Properties
Name  |   Description
Document
 The current document.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 See Also
  CodeCheckingParameterServiceData Class
  Autodesk.Revit.DB.Structure Namespace